## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.scan_files_api will be created
  + resource "aws_cloudfront_distribution" "scan_files_api" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true
      + web_acl_id                     = "arn:aws:wafv2:us-east-1:806545929748:regional/webacl/api_waf/2ce353f5-0a13-4a62-8700-10a4ab6d23d6"

      + default_cache_behavior {
          + allowed_methods            = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = false
          + default_ttl                = (known after apply)
          + max_ttl                    = (known after apply)
          + min_ttl                    = 0
          + response_headers_policy_id = "12985cc0-d422-4ee5-844b-74125f0c6c19"
          + target_origin_id           = "scan-files-api"
          + trusted_key_groups         = (known after apply)
          + trusted_signers            = (known after apply)
          + viewer_protocol_policy     = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + logging_config {
          + bucket          = "scan-files-production-logs.s3.amazonaws.com"
          + include_cookies = false
          + prefix          = "cloudfront"
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "ryafv4e4l4i4e4lrq5zi7jyneq0odcsr.lambda-url.ca-central-1.on.aws"
          + origin_id           = "scan-files-api"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:806545929748:certificate/0c5ad00b-ec1e-4b76-92cf-06b41a5ca9c3"
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_route53_record.scan_files_A will be updated in-place
  ~ resource "aws_route53_record" "scan_files_A" {
        id      = "Z09208862AM3U6FRXOHM8_scan-files.alpha.canada.ca_A"
        name    = "scan-files.alpha.canada.ca"
        # (5 unchanged attributes hidden)

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "d-dt1p5coyo6.execute-api.ca-central-1.amazonaws.com" -> null
          - zone_id                = "Z19DQILCV0OWEC" -> null
        }
      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_wafv2_web_acl_logging_configuration.api_waf will be created
  + resource "aws_wafv2_web_acl_logging_configuration" "api_waf" {
      + id                      = (known after apply)
      + log_destination_configs = [
          + "arn:aws:firehose:us-east-1:806545929748:deliverystream/aws-waf-logs-scan-files",
        ]
      + resource_arn            = "arn:aws:wafv2:us-east-1:806545929748:regional/webacl/api_waf/2ce353f5-0a13-4a62-8700-10a4ab6d23d6"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_versioning resource instead

(and 23 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
